app/Services/Room/RoomService.php

select * from `questions` where `questions`.`quest_id` in (2)
select * from `quests` where `quests`.`id` in (2)
select * from `room_participants` where `room_participants`.`room_id` in (2)
select * from `users` where `users`.`id` in (1)
---
    public function loadDetails(Room $room): Room
    {
        return $room
            ->load([
                'owner',
                'quest',
                'quest.questions',
                'participants.user',
            ]);

select exists(select * from `users` inner join `room_participants` on `users`.`id` = `room_participants`.`user_id` where `room_participants`.`room_id` = 2 and `user_id` = 6) as `exists`
insert into `room_participants` (`question_id`, `room_id`, `user_id`) values (1, 2, 6)
---
    public function joinRoom(User $user, Room $room): bool
    {
        if ($room->users()->where('user_id', $user->id)->exists()) {
            return true;
        }

        if ($room->max_participants === $room->users()->count()) {
            return false;
        }

        $room->users()->attach($user, [
            'question_id' => 1,
        ]);